src/cfe/КСП/InformationRegisters/КСП_ОграниченияИмпортаДокументовУПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ОграниченияИмпортаДокументовУПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешитьИмпорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидДокументаУПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ВидыДокументовУПП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладУПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_СкладыУПП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_СкладыУПП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_ОграниченияИмпортаДокументовУПП/Ext/ManagerModule.bsl
// Если в регистре есть запись, возвращает значение ресурса
// Иначе - возвращает ЛОЖЬ
//
// Параметры:
//	ВидДокументаУПП 	- спр ссыклка ксп_ВидыДокументовУПП - 
//	СкладПолучатель 	- спр ссыклка ксп_СкладыУПП - 
//	СкладОтправитель 	- спр ссыклка ксп_СкладыУПП - 
//
// Возвращаемое значение:
//	Тип: Булево
//
// Пример кода
//	Если Вычислить("РегистрыСведений.КСП_ОграниченияИмпортаДокументовУПП.РазрешитьИмпорт(ВидДокументаУППСсылка, СкладУПП, Неопределено)") = ЛОЖЬ Тогда
//		мЛоггер.инфо("Импорт документа запрещен в регистре %1. Документ : %2", "КСП_ОграниченияИмпортаДокументовУПП", ПредставлениеДокументаУПП);
//		Возврат
//
Функция РазрешитьИмпорт(ВидДокументаУПП, СкладПолучатель, СкладОтправитель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.РазрешитьИмпорт КАК РазрешитьИмпорт
		|ИЗ
		|	РегистрСведений.КСП_ОграниченияИмпортаДокументовУПП КАК Рег
		|ГДЕ
		|	Рег.ВидДокументаУПП = &ВидДокументаУПП
		|	И Рег.СкладУПП = &СкладУПП
		|	";
	
	Запрос.УстановитьПараметр("ВидДокументаУПП", ВидДокументаУПП);
	Запрос.УстановитьПараметр("СкладУПП", СкладПолучатель);
	Если ЗначениеЗаполнено(СкладОтправитель) Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		Запрос.Текст = Запрос.Текст + " И Рег.СкладОтправитель = &СкладОтправитель ";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.РазрешитьИмпорт;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
